'use strict';

const questions = [
    {
        question: 'Сколько раз в сутки подзаводят куранты Спасской башни Кремля?',
        options: ['Один', 'Два', 'Три ', 'Четыре'],
        answer: 1
    },
    {
        question: 'Кто 1-м получил Нобелевскую премию по литературе?',
        options: ['Романист', 'Драматург', 'Поэт    ', 'Эссеист'],
        answer: 2
    },
    {
        question: 'С какой буквы начинаются слова, опубликованные в 16-м томе последнего издания Большой советской энциклопедии?',
        options: ['М', 'Н', 'О', 'П'],
        answer: 0
    },
    {
        question: 'Кто из перечисленных был пажом во времена Екатерины II?',
        options: ['Д.И. Фонвизин', 'Г.Р. Державин', 'А.Н. Радищев ', 'Н.М. Карамзин'],
        answer: 2
    },
    {
        question: 'Какой химический элемент назван в честь злого подземного гнома?',
        options: ['Гафний  ', 'Кобальт', 'Бериллий', 'Теллур'],
        answer: 1
    }
];