'use strict';

/*6**. (Это задание не является частью курса, можете его не делать, оно для тех кому мало
  обычных заданий, требует времени и возможно гугления, делайте по желанию.)
  Программа должна спросить у пользователя число, это будет количество денег, которое он хочет
  положить на счет в банке. Затем программа должна выдать примерно такое сообщение:
  "Ваша сумма в 101 рубль успешно зачислена." - в случае если пользователь ввел 101.
  "Ваша сумма в 10020 рублей успешно зачислена." - в случае если пользователь ввел 10020.
  "Ваша сумма в 120104 рубля успешно зачислена." - в случае если пользователь ввел 120104.*/

let numMoney = +prompt('Ведите сумму, которую хотите положить на счет в банке.', ''),
    lastNum = String(numMoney).charAt(String(numMoney).length - 1); // Присваиваем последнее число из введённой суммы

if (!isNaN(numMoney) && numMoney != 0 && numMoney > 0) {     // Проверяем что пользователь ввёл положительно число
  if (lastNum == 0 || lastNum >= 5) {
    alert(`Ваша сумма в ${numMoney} рублей успешно зачислена.`);
  } else if (lastNum == 1) {
    alert(`Ваша сумма в ${numMoney} рубль успешно зачислена.`);
  } else {
    alert(`Ваша сумма в ${numMoney} рубля успешно зачислена.`);
  }
} else { 
  alert('Введите положительно число');
}